# GalPerH Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..GalPerH Property
SymbolTypeId Class See Also
---
Symbol gal/h, indicating unit US gallons per hour.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId GalPerH { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GalPerH As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GalPerH {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace